# TODO Цифровой корень
#
# На вход программе подается натуральное число n.
# Напишите программу, которая находит цифровой корень данного числа.
# Цифровой корень числа n получается следующим образом:
# если сложить все цифры этого числа, затем все цифры найденной суммы
# и повторить этот процесс, то в результате будет получено однозначное число (цифра),
# которое и называется цифровым корнем данного числа.
#
# Формат входных данных
# На вход программе подается одно натуральное число.
#
# Формат выходных данных
# Программа должна вывести цифровой корень введенного числа.
#
# Примечание. Используйте вложенные циклы while.

digital, num = 0, int(input())
while num > 9:
    total = 0
    while num > 0:
        digital = num % 10
        total += digital
        num //= 10
    num = total
if num < 10:
    total = num
print(total)
