# TODO Сортировка трёх 🌶️
#
# Напишите программу, которая упорядочивает три числа от большего к меньшему.
#
# Формат входных данных
# На вход программе подается три целых числа, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести три числа, каждое на отдельной строке, упорядоченных от большего к меньшему.

num_1, num_2, num_3 = int(input()), int(input()), int(input())
num_max = max(num_1, num_2, num_3)
num_min = min(num_1, num_2, num_3)
num_mid = num_1 + num_2 + num_3 - num_min - num_max
print(num_max)
print(num_mid)
print(num_min)
