# TODO Любимая команда
#
# На вход программе подается строка текста – название футбольной команды.
# Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).
#
# Формат входных данных
# На вход программе подается название футбольной команды.

team = input()
print(team, "- чемпион!")
