# TODO Повторяй за мной
#
# Напишите программу, которая считывает три строки по очереди,
# а затем выводит их в той же последовательности, каждую на отдельной строчке.
#
# Формат входных данных
# На вход программе подаются три строки, каждая на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести введенные строки в той же последовательности, каждую на отдельной строке.
#
# Примечание. Используйте 3 переменные для сохранения введённых строк текста.

str1 = input()
str2 = input()
str3 = input()
print(str1)
print(str2)
print(str3)
