# TODO В одну строку 3
#
# На вход программе подается строка текста, содержащая целые числа.
# Напишите программу, использующую списочное выражение, которая выведет
# квадраты четных чисел, которые не оканчиваются на цифру 4.
#
# Формат входных данных
# На вход программе подается строка текста, содержащая целые числа,
# разделенные символом пробела.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
#
# Примечание. Программу можно написать в одну строку кода.

print(*[int(i) ** 2 for i in list(input().split()) if int(i) % 2 == 0 if int(i) ** 2 % 10 != 4])
