# TODO Наибольшие числа 🌶️🌶️
#
# На вход программе подается натуральное число n, а затем n различных
# натуральных чисел, каждое на отдельной строке. Напишите программу,
# которая выводит наибольшее и второе наибольшее число последовательности.
#
# Формат входных данных
# На вход программе подаются натуральное число n≥2, а затем n различных
# натуральных чисел, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести два наибольших числа, каждое на отдельной строке.

n = int(input())
greatest = int(input())
second_largest = 0
for i in range(n - 1):
    num = int(input())
    if num > greatest:
        second_largest = greatest
        greatest = num
    if second_largest < num < greatest:
        second_largest = num
print(greatest, second_largest, sep='\n')
