# TODO Количество дней
#
# Напишите функцию get_days(month), которая принимает в качестве
# аргумента номер месяца и возвращает количество дней в данном месяце.
#
# Примечание 1. Гарантируется, что передаваемый аргумент находится
# в диапазоне от 1 до 12.
#
# Примечание 2. Считайте, что год является невисокосным.

# объявление функции
def get_days(month):
    month = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
    return month[num - 1]


# считываем данные
num = int(input())

# вызываем функцию
print(get_days(num))
